[
        {
        "title": "DSC 209R - Lab 7: Boston Bike Traffic",
        "year": "2025",
        "image": "/images/Screenshot_lab7.jpg",
        "url": "https://oneeljilc.github.io/bike-traffic/",
        "description": "The goal of this project is to visualize civilian complaints against the NYPD from 1985–2019 at the precinct level, allowing users to explore how complaint patterns changed over time and which areas experienced the highest concentration of reports."
    },
    {
        "title": "DSC 209R - Project 3: Mapping Misconduct: NYPD Complaint Trends (1985–2019)",
        "year": "2025",
        "image": "/images/DSC209R_Project3.jpg",
        "url": "https://oneeljilc.github.io/NYPD_misconduct_heatmap/",
        "description": "The goal of this project is to visualize civilian complaints against the NYPD from 1985–2019 at the precinct level, allowing users to explore how complaint patterns changed over time and which areas experienced the highest concentration of reports."
    },
    {
        "title": "DSC 209R - Project 1: Is Whole Foods really 'Whole Paycheck'?",
        "year": "2025",
        "image": "/images/DSC209R_Project1.png",
        "description": "An expository visualization designed to communicate an idea based on a small grocery dataset consisting of different food items from three different major supermarket chains. Numpy & Pandas were used to manipulate the data and MatPlotLib & Seaborn were used for plotting."
    },
    {
        "title": "DSC 209R - Project 2: Deceptive Visualization of Abortion Data",
        "year": "2025",
        "image": "/images/DSC209R_Project2.jpg",
        "description": "Two visualizations intended to persuade readers of opposite sides of a controversial proposition. Abortion data by U.S. State (collected by the Guttmacher Institute) was analyzed and plotted in order to address the proposition: 'States that lost abortion clinics saw the largest declines in abortion'."
    },
    {
        "title": "DSC 232R - Final Project: '100 Million+ Steam Reviews'",
        "year": "2025",
        "image": "/images/DSC232R_final.png",
        "description": "Pyspark was used to analyze a large dataset of video game reviews and train two machine learning models. Model #1 consisted of a simple recommender system that used k-means to cluster games and users into 10 personas. Model #2 used a random forest regressor to predict a game's popularity based on the review text and game metadata."
    },
    {
        "title": "DSC 207R - Final Project: Analysis of Walt Disney World Wait Time Data",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A large dataset of wait times for Walt Disney World attractions is explored in order to answer three research questions: 1) When is the best time to visit the Magic Kingdom if you would like to minimize time waiting in lines?, 2) What are the top three factors that impact Magic Kingdom wait times?, and 3) Can Magic Kingdom wait times be predicted given other external information?. "
    },
    {
        "title": "Inventore voluptatem blanditiis explicabo.",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Ex, aspernatur ipsam laborum nihil praesentium enim qui quia, quaerat quasi sequi officiis rem minima? Quis, et reprehenderit. Inventore recusandae necessitatibus minus praesentium quos reprehenderit nesciunt vitae, saepe mollitia est."
    },
    {
        "title": "Aperiam tempore quos asperiores.",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Tenetur harum quae eius, sint nisi unde maxime laudantium saepe ad assumenda earum eum sequi incidunt, rerum temporibus nobis. Ab, amet autem impedit commodi dolor quibusdam possimus id qui ea."
    },
    {
        "title": "Placeat natus debitis neque.",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Officiis, porro labore ratione quidem nobis dolorum? Nemo, aspernatur illo ut sit fugit id numquam sed adipisci nesciunt quas delectus illum ratione natus distinctio laborum consectetur molestias accusantium eveniet esse!"
    },
    {
        "title": "Accusantium fugiat ab et!",
        "year": "2020",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Adipisci facere pariatur placeat dolorum iusto consectetur asperiores earum enim! Sequi, velit? Tempore deleniti quae enim! Rem aspernatur alias iure nam dignissimos obcaecati soluta, pariatur modi esse. Veritatis, enim atque?"
    },
    {
        "title": "Quo sunt harum nulla!",
        "year": "2019",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptatibus soluta commodi suscipit quasi, esse nostrum obcaecati dolores quod reprehenderit sit ab nisi facere expedita doloremque harum perspiciatis facilis officia maiores eligendi iusto, quidem voluptate et! Similique, qui eius!"
    },
    {
        "title": "Iste reprehenderit quia architecto.",
        "year": "2019",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Veniam quis nam, corrupti tempore in voluptatum nihil aliquam quo numquam tenetur sed consequuntur, non minus laborum sunt, omnis quod facere ut ipsum consequatur minima architecto quibusdam expedita ratione? Deleniti?"
    }
]